In [3]:
import pandas as pd
exam = pd.read_csv('exam.csv')

In [6]:
# math 평균 구하기 
exam.agg(mean_math = ('math', 'mean'))

            math
mean_math  57.45

In [7]:
# 반(nclass)별로 그룹화하고, 그룹별로 변수(컬럼) math에 대한 평균(mean)을 구하고,
# 변수 이름을 mean_math로 함.
# 기본적으로 nclass가 인덱스가 됨
exam.groupby('nclass').agg(mean_math = ('math', 'mean'))

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [8]:
# 반(nclass)별로 그룹화하고,
# 그룹별로 변수(컬럼) math에 대한 평균(mean)을 구하고,
# 변수 이름을 mean_math로 함.
# nclass를 인덱스로 만들지 않음
exam.groupby('nclass', as_index = False).agg(mean_math = ('math', 'mean'))

   nclass  mean_math
0       1      46.25
1       2      61.25
2       3      45.00
3       4      56.75
4       5      78.00

In [9]:
# 반(nclass)별로 그룹화하고, 그룹별로
# mean_math 변수에 math에 대한 평균(mean) 값을
# sum_math 변수에 math에 대한 합(sum) 값을 생성함
exam.groupby('nclass') \
.agg(mean_math = ('math', 'mean'),
sum_math = ('math', 'sum'))

        mean_math  sum_math
nclass
1           46.25       185
2           61.25       245
3           45.00       180
4           56.75       227
5           78.00       312

In [11]:
# 반(nclass)별로 그룹화하고, 그룹별로
# mean_math 변수에 math에 대한 평균(mean) 값을
# sum_math 변수에 math에 대한 합(sum) 값을 생성함
# median_math 변수에 math에 대한 중앙값(median) 값을 생성함
# n 변수에 math에 대한 그룹내 개수(count) 값을 생성함
exam.groupby('nclass') \
.agg(mean_math = ('math', 'mean'),
     sum_math = ('math', 'sum'),
     median_math = ('math', 'median'),
     n = ('math', 'count')
)

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

In [12]:
# 반(nclass)별로 그룹화하고, 그룹별로
# 각 변수에 대한 평균(mean) 값 구하기
exam.groupby('nclass').mean()

          id   math  english  science
nclass
1        2.5  46.25    94.75    61.50
2        6.5  61.25    84.25    58.25
3       10.5  45.00    86.50    39.25
4       14.5  56.75    84.75    55.00
5       18.5  78.00    74.25    83.25

In [3]:
# mpg.csv 데이터를 데이터 프레임 mpg로 읽어 들임
import pandas as pd
mpg = pd.read_csv('mpg.csv')

In [6]:
# 자동차 브랜드별로 drv 방식별로 cty의 평균, 도심에서의 연비의 평균을 구해라 (asscending=Fals - 큰수부터 나타내게 하기 )
mpg.groupby(['manufacturer', 'drv']).agg(mean_cty = ('cty', 'mean')) \
    .sort_values('mean_cty', ascending=False).head()

                   mean_cty
manufacturer drv
honda        f    24.444444
toyota       f    21.368421
volkswagen   f    20.925926
nissan       f    20.000000
subaru       4    19.285714

In [5]:
# 제조사(manufacturer)가 audi인 자동차를 대상으로
# 구동방식(drv)에 따라 그룹화하고, 그룹별로
# n 변수에 구동방식 drv에 대한 그룹네 개수(count) 값을 구하여 출력
mpg.query('manufacturer == "audi"') \
.groupby(['drv']) \
.agg(n = ('drv', 'count'))

      n
drv
4    11
f     7

In [7]:
# 구동방식(drv)에 따라 그룹화하고, 그룹별로
# n 변수에 구동방식 drv에 대한 그룹네 개수(count) 값을 구하여 출력
mpg.groupby('drv').agg(n = ('drv', 'count'))

       n
drv
4    103
f    106
r     25

In [8]:
# 구동방식 drv에 대한 그룹네 개수 값을 구하여 출력
mpg.value_counts('drv') # 시리즈로 출력

drv
f    106
4    103
r     25
dtype: int64

In [9]:
# 구동방식 drv에 대한 그룹네 개수 값을 구하여 출력
mpg.value_counts('drv').to_frame('count') # 데이터 프레임으로 출력 (변수 이름 count)

     count
drv
f      106
4      103
r       25

In [10]:
# 구동방식 drv에 대한 그룹네 개수가 100개 초과인 구동방식(drv)을 구하여 출력
mpg.value_counts('drv').to_frame('count').query('count > 100')

     count
drv
f      106
4      103

In [11]:
# Lab 4 : mpg 데이터에서 suv 제조사의 합산 평균 연비 상위 1 ~ 5위 제조사 출력하기

In [12]:
# (1) mpg.csv 파일을 데이터 프레임 mpg로 읽어 들임
mpg = pd.read_csv('mpg.csv')

In [13]:
# (2) 데이터 프레임 mpg에서 차종(category)가 suv인 자동차만 골라 mpg_new로 생성
mpg_new = mpg.query('category == "suv"')
mpg_new.head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
18,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv
19,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,11,15,e,suv
20,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv

In [14]:
# (3) 데이터 프레임 mpg_new에 도시연비(cty)와 고속도로연비(hwy)의 평균 값을 갖는 파생변수 생성
mpg_new = mpg_new.assign(total = (mpg['hwy'] + mpg['cty'])/ 2 )
mpg_new.head(3)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
18,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv,17.0
19,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,11,15,e,suv,13.0
20,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv,17.0

In [15]:
# (4) 제조사(manufacturer)에 따라 그룹화하고, 그룹별로
# mean_tot 변수에 통합연비 total에 대한 평균(mean) 값을 구하여 mpg_new에 저장
mpg_new = mpg_new.groupby('manufacturer')\
.agg(mean_tot = ('total', 'mean'))
mpg_new.head(3)

               mean_tot
manufacturer
chevrolet     14.888889
dodge         13.928571
ford          15.333333

In [16]:
# (5) mpg_new를 평균 연비 변수 mean_tot 값을 기준으로 내림차순으로 정렬
mpg_new = mpg_new.sort_values('mean_tot', ascending = False)
mpg_new.head(3)

               mean_tot
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000

In [17]:
# (6) mpg_new 데이터 프레임을 상위 5개 값을 출력
mpg_new.head(5)

               mean_tot
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000
mercury       15.625000
jeep          15.562500

In [18]:
# 상의 cell의 (1) ~ (6)까지 의 작업을 하나의 구문으로 처리
mpg.query('category == "suv"')\
.assign(total = (mpg['hwy'] + mpg['cty'])/ 2 )\
.groupby('manufacturer')\
.agg(mean_tot = ('total', 'mean'))\
.sort_values('mean_tot', ascending = False)\
.head(5)

               mean_tot
manufacturer
subaru        21.916667
toyota        16.312500
nissan        15.875000
mercury       15.625000
jeep          15.562500

In [19]:
# Lab 5 : 혼자서 해보기(mpg 데이터 분석)

In [21]:
# 데이터 합치기 (merge(), concat())
# Lab 6 : 가로로 합치기

In [23]:
# 중간고사 점수를 갖는 데이터 프레임 생성
test1 = pd.DataFrame( {'id' : [1, 2, 3, 4, 5, 6],
'midterm' : [60, 80, 70, 90, 85, 66]
})
test1

   id  midterm
0   1       60
1   2       80
2   3       70
3   4       90
4   5       85
5   6       66

In [25]:
# 기말고사 점수를 갖는 데이터 프레임 생성
test2 = pd.DataFrame( {'id' : [1, 2, 3, 4, 5, 7],
'finalterm' : [70, 83, 65, 95, 80, 77]
})
test2

   id  finalterm
0   1         70
1   2         83
2   3         65
3   4         95
4   5         80
5   7         77

In [27]:
# 데이터 프레임 test1과 test2를 가로로 합치기 (how = 'left')
total = pd.merge(test1, test2, how = 'left', on = 'id')
total

   id  midterm  finalterm
0   1       60       70.0
1   2       80       83.0
2   3       70       65.0
3   4       90       95.0
4   5       85       80.0
5   6       66        NaN

In [28]:
# 데이터 프레임 test1과 test2를 가로로 합치기 (how = 'right')
total = pd.merge(test1, test2, how = 'right', on = 'id')
total

   id  midterm  finalterm
0   1     60.0         70
1   2     80.0         83
2   3     70.0         65
3   4     90.0         95
4   5     85.0         80
5   7      NaN         77

In [32]:
# 세로로 합치기

In [33]:
# 첫번째 시험 결과 데이터 프레임으로 생성
group_a = pd.DataFrame({'id' : [1, 2, 3, 4, 5],
'test' : [60, 80, 70, 90, 85]
})

In [34]:
# 두번째 시험 결과 데이터 프레임으로 생성
group_b = pd.DataFrame({'id' : [6, 7, 8, 9, 10],
'test' : [70, 83, 65, 95, 80]
})

In [35]:
group_a

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85

In [37]:
group_b

   id  test
0   6    70
1   7    83
2   8    65
3   9    95
4  10    80

In [38]:
# 첫번째와 두번째 시험 결과 데이터 프레임을 세로로 합치기
group_all = pd.concat([group_a, group_b])
group_all

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85
0   6    70
1   7    83
2   8    65
3   9    95
4  10    80

In [39]:
group_all = pd.concat([group_a, group_b], ignore_index=True)
group_all

   id  test
0   1    60
1   2    80
2   3    70
3   4    90
4   5    85
5   6    70
6   7    83
7   8    65
8   9    95
9  10    80

In [41]:
# Lab 8 : 혼자서 해보기
# 연료 종류별 가격(갤런당 USD) 데이터를 가지고 mpg 데이터를 분석해보시오

In [42]:
fuel = pd.DataFrame({'fl' : ['c', 'd', 'e', 'p', 'r'],
'price_fl' : [2.35, 2.38, 2.11, 2.76, 2.22]
})
fuel

  fl  price_fl
0  c      2.35
1  d      2.38
2  e      2.11
3  p      2.76
4  r      2.22

In [45]:
# mpg에 연료 종류 값을 갖는 변수 fl을 기준으로 mpg와 fuel을 가로로 합치기
mpg = pd.merge(mpg, fuel, how='left', on='fl')
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,price_fl
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,2.76
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,2.76
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,2.76
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,2.76
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,2.76

In [46]:
# Q2 : 자동차 모델별로 연료 가격을 확인하기 위해 model, fl, price_fl 변수를 추출하여 앞부분 5개 행을 출력 하시오

In [47]:
# mpg에서 변수 model, fl, price_fl을 출력
mpg[['model', 'fl', 'price_fl']].head(5)

  model fl  price_fl
0    a4  p      2.76
1    a4  p      2.76
2    a4  p      2.76
3    a4  p      2.76
4    a4  p      2.76

In [48]:
# Lab 9 : 분석 도전